In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\motomote\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

# DataFrame using pandas

In [2]:
import pandas as pd

#creat a dataframe 
data={
    'Toy':['teddy bear', 'robot', 'doll', 'car'],
    'price':[20, 40, 10, 50]
}

#using pandas to create the dataframe
toys_df=pd.DataFrame(data)

#display 
toys_df

          Toy  price
0  teddy bear     20
1       robot     40
2        doll     10
3         car     50

# Price of any specific Toy

In [5]:
#finding the price of the robot
robot_price=toys_df[toys_df['Toy']=='robot']['price'].iloc[0]
robot_price

np.int64(40)

In [4]:
robot_price=toys_df[toys_df['Toy']=='robot']['price']
robot_price

1    40
Name: price, dtype: int64

# Addition of new Toy with Price

In [7]:
#addition a new toy 
new_toy={'Toy': 'mobile', 'price': 100}
#convert the new toy data into a dataframe
new_toys_df=pd.DataFrame([new_toy])

toys_df=pd.concat([toys_df, new_toys_df], ignore_index=True)


print(toys_df)

          Toy  price
0  teddy bear     20
1       robot     40
2        doll     10
3         car     50
4      mobile    100

# Remove a  Toy from the table

In [8]:
#remove the doll from the dataframe
toys_df=toys_df[toys_df['Toy']!='doll']
toys_df

          Toy  price
0  teddy bear     20
1       robot     40
3         car     50
4      mobile    100

# Sorting the dataframe by the price column

In [9]:
#sorting the dataframe by the price column
sort_toys_df=toys_df.sort_values(by='price')

sort_toys_df

          Toy  price
0  teddy bear     20
1       robot     40
3         car     50
4      mobile    100

# Renaming columne name

In [10]:
#renaming columns in the dataframe
rename_toys_df=sort_toys_df.rename(columns={'Toy':'Toy name', 'price': 'toy price'})
rename_toys_df

     Toy name  toy price
0  teddy bear         20
1       robot         40
3         car         50
4      mobile        100

In [4]:
data

{'Toy': ['teddy bear', 'robot', 'doll', 'car'], 'price': [20, 40, 10, 50]}

In [11]:
rename_toys_df

     Toy name  toy price
0  teddy bear         20
1       robot         40
3         car         50
4      mobile        100

# Calculating the Average

In [13]:
Average_price=rename_toys_df['toy price'].mean()
Average_price

np.float64(52.5)

# Most expensive toy

In [20]:
most=rename_toys_df['toy price'].max()
most

np.int64(100)

In [21]:
most_expensive=rename_toys_df[rename_toys_df['toy price']==most]
most_expensive

  Toy name  toy price
4   mobile        100

# Cheapest Toy

cheap=rename_toys_df['toy price'].min()
cheap

In [26]:
most_cheap=rename_toys_df[rename_toys_df['toy price']==cheap]
most_cheap

     Toy name  toy price
0  teddy bear         20

# Counting the number of Toys

In [28]:
number_of_toys=rename_toys_df['Toy name'].count()
number_of_toys

np.int64(4)

# Apply Discount on all Toys Prices

In [29]:
rename_toys_df['Brand']=['Lego', 'Techtoys', 'Lego', 'FunchCo']

average_price_by_brand=rename_toys_df.groupby('Brand')['toy price'].mean()
average_price_by_brand

Brand
FunchCo     100.0
Lego         35.0
Techtoys     40.0
Name: toy price, dtype: float64

# Filtering  toys that cost $20 or less

In [30]:
afford_toys=rename_toys_df[rename_toys_df['toy price']<= 20]
afford_toys

     Toy name  toy price Brand
0  teddy bear         20  Lego

# Resetting the index for the afford toys Dataframe

In [32]:
affordable_toys_reset=afford_toys.reset_index(drop=True)
affordable_toys_reset

     Toy name  toy price Brand
0  teddy bear         20  Lego

# Creating a new dataframe with toy reviews

In [37]:
reviews_data={
    'Toy name':['teddy bear', 'robot', 'car', 'mobile'],
    'review':['love it!', 'super cool!', 'fun and challenging', 'good']
}

reviews_df=pd.DataFrame(reviews_data)


#combine the toy prices and reviews ataframe
combine_df=pd.merge(rename_toys_df, reviews_df, on='Toy name', how='left')
combine_df

     Toy name  toy price     Brand               review
0  teddy bear         20      Lego             love it!
1       robot         40  Techtoys          super cool!
2         car         50      Lego  fun and challenging
3      mobile        100   FunchCo                 good

# Filling in missing reviews with 'no reviews yet'

In [42]:
combine_df['review']=combine_df['review'].fillna('no review yet')
combine_df

     Toy name  toy price     Brand               review price category
0  teddy bear         20      Lego             love it!      afforable
1       robot         40  Techtoys          super cool!      expensive
2         car         50      Lego  fun and challenging      expensive
3      mobile        100   FunchCo                 good      expensive

# Creating a new column'price category'

In [39]:
combine_df['price category']=['expensive' if price > 20 else 'afforable' for price in combine_df['toy price']]
combine_df

     Toy name  toy price     Brand               review price category
0  teddy bear         20      Lego             love it!      afforable
1       robot         40  Techtoys          super cool!      expensive
2         car         50      Lego  fun and challenging      expensive
3      mobile        100   FunchCo                 good      expensive

# Drop the brand column

In [40]:
combine_df_brand=combine_df.drop(columns=['Brand'])
combine_df_brand

     Toy name  toy price               review price category
0  teddy bear         20             love it!      afforable
1       robot         40          super cool!      expensive
2         car         50  fun and challenging      expensive
3      mobile        100                 good      expensive

# Save and Read the DataFrame to a CSV file

In [46]:
#saving the dataframe to a csv file
combine_df_brand.to_csv('toys_data.csv', index=False)

#reading data from the csv file
read_toys_df=pd.read_csv('toys_data.csv')
read_toys_df

     Toy name  toy price               review price category
0  teddy bear         20             love it!      afforable
1       robot         40          super cool!      expensive
2         car         50  fun and challenging      expensive
3      mobile        100                 good      expensive

# Getting descriptive statistics for the 'price' column

In [48]:
price_state=read_toys_df['toy price'].describe()
price_state

count      4.000000
mean      52.500000
std       34.034296
min       20.000000
25%       35.000000
50%       45.000000
75%       62.500000
max      100.000000
Name: toy price, dtype: float64

# Getting unique reviews from 'review' column

In [50]:
unique_review=read_toys_df['review'].unique()
unique_review

array(['love it!', 'super cool!', 'fun and challenging', 'good'],
      dtype=object)